[
  {
    "id": "1735689781123abc",
    "title": "مقال تجريبي للاختبار",
    "content": "هذا مقال تجريبي لاختبار وظائف لوحة التحكم الإدارية. يحتوي على محتوى كافي لاختبار عرض المقالات والموافقة عليها أو رفضها.",
    "author": "مستخدم تجريبي",
    "date": "2025-01-01",
    "approved": false,
    "status": "pending",
    "createdAt": "2025-01-01T10:00:00.000Z"
  },
  {
    "id": "1735689781124def",
    "title": "مقال آخر للمراجعة",
    "content": "هذا مقال آخر في انتظار المراجعة والموافقة من قبل الإدارة. يمكن استخدامه لاختبار وظائف الموافقة والرفض.",
    "author": "كاتب آخر",
    "date": "2025-01-01",
    "approved": false,
    "status": "pending",
    "createdAt": "2025-01-01T11:00:00.000Z"
  },
  {
    "id": "1735689781125ghi",
    "title": "مقال منشور",
    "content": "هذا مقال تم نشره بالفعل ويظهر في قسم المقالات المنشورة.",
    "author": "محرر الموقع",
    "date": "2024-12-31",
    "approved": true,
    "status": "approved",
    "createdAt": "2024-12-31T15:00:00.000Z"
  },
  {
    "id": "1735689781126jkl",
    "title": "مقال طويل لاختبار العرض الكامل",
    "content": "هذا مقال طويل يحتوي على محتوى مفصل لاختبار عرض المحتوى الكامل في النافذة المنبثقة.\n\nالفقرة الأولى تتحدث عن أهمية التكنولوجيا في حياتنا اليومية وكيف أصبحت جزءاً لا يتجزأ من روتيننا اليومي. نحن نستخدم الهواتف الذكية والحاسوب والإنترنت في كل شيء تقريباً.\n\nالفقرة الثانية تناقش التطورات الحديثة في مجال الذكاء الاصطناعي وكيف يؤثر على مختلف الصناعات. من الطب إلى التعليم، ومن النقل إلى الترفيه، الذكاء الاصطناعي يغير طريقة عملنا وحياتنا.\n\nالفقرة الثالثة تتطرق إلى التحديات التي نواجهها مع هذا التطور السريع. مسائل الخصوصية، الأمان السيبراني، وتأثير التكنولوجيا على سوق العمل كلها موضوعات مهمة يجب مناقشتها.\n\nفي الختام، التكنولوجيا سيف ذو حدين، يمكن أن تكون مفيدة جداً إذا استخدمت بالطريقة الصحيحة، ولكنها قد تكون ضارة إذا لم نتعامل معها بحذر ووعي.",
    "author": "كاتب تقني",
    "date": "2025-01-02",
    "approved": true,
    "status": "approved",
    "createdAt": "2025-01-02T10:00:00.000Z",
    "category": "technology",
    "excerpt": "مقال مفصل حول تأثير التكنولوجيا والذكاء الاصطناعي على حياتنا اليومية والتحديات المرتبطة بها."
  }
]